Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/unemployed_people/jobseekers_allowance.html.txt.tmx
Source language: en
Languages: ga

source: If your spouse, civil partner or cohabitant works or is taking part in a Community Employment (CE scheme), Tús or Gateway their earnings from insurable employment are assessed in the same way as your earnings from part-time or casual work
ga: Más rud é go bhfuil post ag do chéile, do pháirtnéir sibhialta nó do chomháitritheoir, nó go bhfuil sé/sí páirteach i scéim Fostaíocht Pobail (CE), i scéim Tús nó i scéim Gateway, is féidir go ndéanfaidh sé sin difear don íocaíocht Liúntas Cuardaitheora Poist a fhaigheann do theaghlach

source: Find out more about work and Jobseeker’s Allowance
ga: Faigh tuilleadh faisnéise faoi obair agus Liúntas Cuardaitheora Poist

source: You can collect your Jobseeker’s Allowance payment weekly from your nearest Post Office
ga: Is féidir do Liúntas Cuardaitheora Poist a bhailiú ón Oifig an Phoist is gaire duit gach seachtain

source: You must bring valid photographic identification (photo ID) with you to collect your payment
ga: Caithfidh tú aitheantas fótagrafach a thabhairt leat chun d’íocaíocht a bhailiú

source: The following is considered to be valid photo ID:
ga: Meastar na rudaí a leanas mar aitheantas fótagrafach bailí:

source: • EU/EEA nationals may use a National Identity Card
ga: • Is féidir le náisiúnaigh AE/LEE Cárta Aitheantais Náisiúnta a úsáid

source: Staff working in the Post Office may ask to see your photo ID before giving you your payment
ga: Féadfar go n-iarrfaidh an fhoireann in Oifig an Phoist d’aitheantas fótagrafach a fheiceáil roimh d’íocaíocht a thabhairt duit

source: If you are getting Jobseeker's Allowance, you may be entitled to:
ga: Má tá tú ag fáil Liúntas Cuardaitheora Poist, is féidir go mbeidh tú i dteideal na nithe seo a leanas:

source: • Rent Supplement - a payment that helps with the cost of your rent
ga: • Forlíonadh Cíosa - íocaíocht a chabhraíonn le freastal ar chostas do chíosa

source: • Fuel Allowance - a weekly payment between October and April to help with fuel costs
ga: • Liúntas Breosla - íocaíocht sheachtainiúil a dhéantar idir Deireadh Fómhair agus Aibreán a chabhraíonn le freastal ar chostais bhreosla

source: Fuel Allowance is payable to people who have been getting a jobseeker’s payment for 390 days, if they satisfy the relevant qualifying conditions
ga: Tá an Liúntas Breosla iníoctha le daoine atá ag fáil íocaíocht cuardaitheora poist le 390 lá anuas, sa chás go sásaíonn siad na coinníollacha cáilitheacha ábhartha

source: Days of unemployment on Jobseeker's Benefit count towards the 390 days if the Jobseeker’s Benefit claim was immediately before the award of Jobseeker’s Allowance
ga: Áirítear laethanta dífhostaíochta agus tú ag fáil Sochar Cuardaitheora Poist mar chuid den 390 lá sa chás go ndearnadh an t-éileamh ar Shochar Cuardaitheora Poist díreach sular bronnadh Liúntas Cuardaitheora Poist

source: • Back to School Clothing and Footwear Allowance - a payment to help with the cost of uniforms and footwear for children who are attending school
ga: • Liúntas Éadaí agus Coisbhirt don Scoilbhliain Nua - íocaíocht a chabhraíonn le freastal ar an gcostas ar éadaí agus ar choisbheart do leanaí atá ag freastal ar scoil

source: • Medical card - if your income is below a certain level, you may get a medical card
ga: • Cárta leighis - má tá d’ioncam faoi bhun leibhéal áirithe, is féidir go bhfaighidh tú cárta leighis

source: You do not qualify for the Household Benefits Package or Free Travel with Jobseeker’s Allowance
ga: Ní cháilíonn Liúntas Cuardaitheora Poist thú don Phacáiste Sochair Teaghlaigh ná do Shaorthaisteal

source: You should apply for Jobseeker's Allowance as soon as you become unemployed
ga: Ba chóir duit iarratas a dhéanamh ar Liúntas Cuardaitheora Poist chomh luath agus a n-éiríonn tú dífhostaithe

source: It is important to apply as soon as you become unemployed because you will not get paid for the first 3 days of your claim
ga: Tá sé tábhachtach iarratas a dhéanamh chomh luath agus a n-éiríonn tú dífhostaithe toisc nach n-íocfar tú don chéad trí lá den éileamh

source: If your claim is linked to a previous claim for Jobseeker's Allowance, you may be paid for the first 3 days
ga: Má tá d'éileamh nascaithe le h-éileamh níos luaithe ar Liúntas Cuardaitheora Poist, d'fhéadfaí tú a íoc i leith na chéad 3 lá

source: If you make a late claim, it may be backdated if you provide good evidence for the delay
ga: Má chuireann tú iarratas déanach isteach, d'fhéadfaí tú a íoc i leith na tréimhse atá imithe in éag má sholáthraíonn tú fianaise mhaith faoi chúiseanna na moille

source: Jobseeker's Allowance application forms are available online
ga: Tá foirmeacha Liúntáis Cuardaitheora Poist ar fáil ar líne

source: You can also get an application form from your Intreo Centre or Social Welfare Branch Office
ga: Is féidir foirm iarratais a fháil ó d'Ionad Intreo nó ó d'Oifig Bhrainse Leasa Shóisialaigh

source: You will need to bring certain documents with you when you apply for Jobseeker's Allowance
ga: Beidh ort doiciméid áirithe a thabhairt leat leis an éileamh a chruthú

source: You can get help with filling in your application form at your Intreo Centre, Social Welfare Branch Office or nearest Citizens Information Centre
ga: Is féidir le d'Ionad Intreo nó d'Oifig Bhrainse Leasa Shóisialaigh nó Lárionad Faisnéise do Shaoránaigh cuidiú leat chun d'fhoirm iarratais a chomhlánú

source: More information is available in our document about signing on for the first time
ga: Tá tuilleadh eolais faoi iarratas ar Liúntas Cuardaitheora Poist ar fáil sa doiciméid maidir le ag siniú don chéad uair

source: If you think you have been wrongly refused Jobseeker's Allowance you can appeal the decision to the Social Welfare Appeals Office
ga: Má cheapann tú go bhfuil sochar diúltaithe duit go héagórach, is féidir achomharc a chur chuig an Oifig Achomharc Leasa Shóisialaigh

source: You should apply for Jobseeker's Allowance to your Intreo Centre or Social Welfare Branch Office
ga: Déan iarratas ar Liúntas Cuardaitheora Poist ag d'Ionad Intreo nó d'Oifig Bhrainse Leasa Shóisialaigh
